{
  "projects": {
    "resume-site": {
      "title": "Resume Website",
      "image": "resume-website-thumbnail.jpg",
      "technologies": "React, JavaScript, CSS, Bootstrap",
      "description": "Built a Resume website featuring project information and a blog using React.js and React-bootstrap. Hosted using AWS.",
      "url": "http://annaggale.com",
      "github": "https://github.com/aggale/resume-site"
    },
    "recipe-site": {
      "title": "My Old Blog",
      "image": "old-blog-thumbnail.jpg",
      "technologies": "NLP, JavaScript, Bootstrap, DynamoDB, Arduino",
      "description": "This was a blog where I wrote about some of the projects I was doing in 2017-2018. I talk about building websites, some of my graduate NLP work, and playing with Arduino.",
      "url": "https://annaggale.wordpress.com/",
      "github": ""
    }
  },
  "blog": {
    "1": {
      "id": 1,
      "url": "why-wont-my-images-load",
      "title": "Why won't my images load??",
      "summary": "Working with images with dynamic paths in a React app that uses Webpack",
      "partialText": "When I was building my resume website, I wanted to have an image display with each project card on my Projects page. The problem? For Webpack to know where your images are, you need to import them into your React component. This is trivial for static images...",
      "posted": "April 26, 2021"
    },
    "2": {
      "id": 2,
      "url": "creative-writing-git",
      "title": "The Power of Git as a Creative Writing Tool",
      "summary": "Creative writing presents many of the same change tracking problems as writing code. Can source control solve them?",
      "partialText": "A big logisitical problem while writing a novel is how to save multiple drafts when you make significant edits or decide to try out a different direction for a chapter but want to keep the text for the new version and the old version around until you decide which one you like. If you're like me, you end up with a folder full of cryptically named drafts that seems to grow and grow. Until the day I realized--this problem has already been solved: source control...",
      "posted": "April 30, 2021"
    }
  }
}
